In [1]:
import pandas as pd

In [31]:
data = {
    'Producto': ['A', 'B', 'C', 'D'],
    'Ventas': [250, None, 300, -700],
    'Precio': [10.5, 20.0, None, 15.0]
}
df = pd.DataFrame(data)
display(df)

  Producto  Ventas  Precio
0        A   250.0    10.5
1        B     NaN    20.0
2        C   300.0     NaN
3        D  -700.0    15.0

In [32]:
df.isna()

   Producto  Ventas  Precio
0     False   False   False
1     False    True   False
2     False   False    True
3     False   False   False

In [33]:
df.isna().sum()

Producto    0
Ventas      1
Precio      1
dtype: int64

In [34]:
data_duplicado = {
    'Producto': ['A', 'B', 'A', 'C'],
    'Ventas': [250, 150, 250, 300]
}
df_duplicado = pd.DataFrame(data_duplicado)
display(df_duplicado)

  Producto  Ventas
0        A     250
1        B     150
2        A     250
3        C     300

In [35]:
df_duplicado.duplicated()

0    False
1    False
2     True
3    False
dtype: bool

In [36]:
df_sin_duplicados = df_duplicado.drop_duplicates()
display(df_sin_duplicados)

  Producto  Ventas
0        A     250
1        B     150
3        C     300

In [37]:
ventas_validas = (df['Ventas'] >= 0) & (df['Ventas'] <= 500)
display(ventas_validas)

0     True
1    False
2     True
3    False
Name: Ventas, dtype: bool

In [38]:
ventas_fuera_de_rango = df[~ventas_validas]
display(ventas_fuera_de_rango)

  Producto  Ventas  Precio
1        B     NaN    20.0
3        D  -700.0    15.0

In [39]:
data_fechas = {
    'Producto': ['A', 'B', 'C'],
    'Fecha': ['2024-01-01', '2024-02-30', '2024-03-15']  # Fecha incorrecta en la segunda fila
}
df_fechas = pd.DataFrame(data_fechas)
display(df_fechas)

  Producto       Fecha
0        A  2024-01-01
1        B  2024-02-30
2        C  2024-03-15

In [40]:
df_fechas['Fecha'] = pd.to_datetime(df_fechas['Fecha'], errors='coerce')
fechas_invalidas = df_fechas[df_fechas['Fecha'].isna()]
display(fechas_invalidas)

  Producto Fecha
1        B   NaT

In [41]:
def validar_ventas_negativas(df):
    if (df['Ventas'] < 0).any():
        print("Existen ventas negativas.")
    else:
        print("No hay ventas negativas.")

validar_ventas_negativas(df)

Existen ventas negativas.

In [42]:
assert df['Ventas'].notna().all(), "Hay valores faltantes en la columna Ventas"

AssertionError: Hay valores faltantes en la columna Ventas